backend/controllers/SiteController.php

DELETE FROM `user` WHERE `id`=1
---
    public function actionDeleteUser($id)
    {
        $user = User::find()
            ->ofId($id)
            ->one();

        if ($user== null) {
            return $this->goHome();
        }

        if ($user->delete()) {

UPDATE `user` SET `updated_at`=1598614257, `is_admin`=1 WHERE `id`=7
---
    public function actionUpdateUser($id)
    {
        $user = User::find()
            ->ofId($id)
            ->one();

        $model = new UserForm();
        $model->fillFrom($user);

        if ($model->load(Yii::$app->request->post())) {
            if ( $model->validate()) {
                $user = $model->fillTo($user);
                $user->save();

UPDATE `ticket` SET `admin_id`=2 WHERE `id`=21
---
    public function actionAssignTicket($id)
    {
        /** @var Ticket $ticket */
        $ticket = Ticket::find()
            ->ofId($id)
            ->one();

        if ($ticket == null) {
            return $this->goHome();
        }

        if ($ticket->admin_id == null) {
            $ticket->admin_id = Yii::$app->user->identity->getId();
        }

        if ($ticket->save()) {