frontend/controllers/SiteController.php

UPDATE `user` SET `password_hash`='$2y$13$nFDreUtbOacjI1sMtnjRpuXfye/fvWnp8QRvXRLJgs0ziYCAVFT9q', `updated_at`=1598613979 WHERE `id`=7
---
    public function actionUpdateProfile()
    {
        $user = User::find()
            ->ofId(Yii::$app->user->identity->getId())
            ->one();

        $model = new UserForm();
        $model->fillFrom($user);

        if ($model->load(Yii::$app->request->post())) {
            if ( $model->validate() && $user->validatePassword($model->old_password)) {
                $user = $model->fillTo($user);
                $user->save();

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=7)
UPDATE `ticket` SET `is_open`=0 WHERE `id`=21
---
    public function actionCloseTicket($id)
    {
        /** @var Ticket $ticket */
        $ticket = Ticket::find()
            ->ofId($id)
            ->ofUserId(Yii::$app->user->identity->getId())
            ->one();

        if ($ticket == null) {
            return $this->goHome();
        }

        if ($ticket->is_open) {
            $ticket->is_open = false;
        }

        if ($ticket->save()) {