common/models/LoginForm.php

UPDATE `user` SET `updated_at`=1598614326, `last_login`='2020/08/28 11:32:06' WHERE `id`=2
---
    public function login()
    {
        if ($this->validate()) {



            $loginSuccess = Yii::$app->user->login($this->getUser(), $this->rememberMe ? 3600 * 24 * 30 : 0);

            if ($loginSuccess) {
                /** @var User $user */
                $user = Yii::$app->user->identity;
                $user->last_login = date("Y-m-d H:i:s");

                if (!$user->save()) {