common/models/Ticket.php

SELECT * FROM `comment` WHERE `ticket_id`=21 ORDER BY `id` DESC LIMIT 1
---
    public function getLatestComment()
    {
        /** @var Comment $latestComment */
        $latestComment = $this->getComments()->orderBy(['id'=>SORT_DESC])->limit(1)->one();