common/models/query/UserQuery.php

SELECT * FROM `user` WHERE 0=1
---
    public function one($db = null)
    {
        return parent::one($db);