frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `status`, `password_hash`, `auth_key`, `verification_token`, `created_at`, `updated_at`) VALUES ('Iphone', 'iphone.user@gmail.com', 10, '$2y$13$3lWzmh6sZPkX048OZMd01OZ345YqpuR3mQh7GqQyUqxDTw2TRVP/y', 'vxo21Ctz_Epb8ltREpJUaJ8702ObTYpE', '8TNfhSVzyOSc9u0f0JNcliyEfHRV7vUd_1598613908', 1598613908, 1598613908)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->status = 10;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save() && $this->sendEmail($user);