frontend/models/TicketForm.php

    public function addTicket()
    {
        $ticket = new Ticket();
        $ticket->user_id = Yii::$app->user->identity->getId();
        $ticket->title = $this->title;
        $ticket->description = $this->description;
        $ticket->save();

        foreach ($this->imageFiles as $file) {
            $file->saveAs('uploads/' . $file->baseName . '.' . $file->extension);

            $image = new Image();
            $image->ticket_id = $ticket->id;
            $image->path = 'uploads/' . $file->baseName . '.' . $file->extension;
            $image->save();
---
INSERT INTO `ticket` (`user_id`, `title`, `description`) VALUES (7, 'Iphone title', 'Iphone description')
INSERT INTO `image` (`ticket_id`, `path`) VALUES (21, 'uploads/asdasd.jpeg')